Написать функцию, возвращающую строку из своих аргументов (предполагается любое количество), где в качестве разделителя выступает первый аргумент.

Пример работы: 
union()  ->  “”

union(‘||’,  ‘a’, ’b’,  ‘c’)  ->  “a||b||c” 
union(‘||’,  ‘a’, ’b’,  ‘c’, ‘d’)  ->  “a||b||c||d”



const union = (divider, ...args) => args.join(divider);

======================================================================

Есть массив ссылок urls = [“/list1.json”, “/list2.json”, …] на данные в формате JSON и есть функция показа сообщения showMessage.
Необходимо написать код, которые вызывает функцию showMessage(“Загрузка завершена”) после того, как выполнятся запросы по всем ссылкам из массива.

async function getUrls(urls) {
    let data = await Promise.all(urls.map((url) => fetch(url).then(data => data.json())));

    showMessage(“Загрузка завершена”);
}

======================================================================

Какой будет вывод после выполнения следующего фрагмента кода?
let p = new Promise(function(resolve, reject) {
    console.log('Создание промиса');
    resolve();
});


setTimeout(function timeout() {
    console.log('Таймаут');
}, 0);


p.then(function(){
    console.log('Обработка промиса');
});

console.log('Конец скрипта');

======================================================================

let b = 0 || “” || 2 || undefined ||true || false

======================================================================

Какой будет вывод после выполнения следующего фрагмента кода?

for (var i = 0; i < 3; i++)  {
        setTimeout(f, 0);
}

const f = (k, j ,h) => console.log(k)


f()

============================================================

